Backrooms/src/Catalogs/Чаты/Чаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Чаты</name>
  <attributes>
    <name>Организатор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сообщения</name>
    <attributes>
      <name>Отправитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Текст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОтправки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.СтатусыСообщений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Backrooms/src/Enums/СтатусыСообщений/СтатусыСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыСообщений</name>
  <enumValues>
    <name>Отправлено</name>
  </enumValues>
  <enumValues>
    <name>Прочитано</name>
  </enumValues>
</mdclass:Enum>

Backrooms/src/Catalogs/Чаты/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЧатыСообщения.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	Справочник.Чаты.Сообщения КАК ЧатыСообщения
		|ГДЕ
		|	ЧатыСообщения.Ссылка.Организатор = &Организатор
		|	И ЧатыСообщения.Ссылка.Участник = &Участник
		|	И ЧатыСообщения.Статус = &Статус
		|	И ЧатыСообщения.Отправитель.ТипАккаунта <> &ТипАккаунта";
	
	Запрос.УстановитьПараметр("Организатор", Объект.Организатор);
	Запрос.УстановитьПараметр("ТипАккаунта", ПараметрыСеанса.Пользователь.ТипАккаунта);
	Запрос.УстановитьПараметр("Участник", Объект.Участник);
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыСообщений.Отправлено);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Объект.Сообщения[ВыборкаДетальныеЗаписи.НомерСтроки - 1] = Перечисления.СтатусыСообщений.Прочитано;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СообщенияПриАктивизацииСтрокиНаСервере()
	Инд = Элементы.Сообщения.ТекущаяСтрока;
	Если НЕ ЗначениеЗаполнено(Объект.Сообщения[Инд]) Тогда
		Объект.Сообщения[Инд].Отправитель = ПараметрыСеанса.Пользователь;
		Объект.Сообщения[Инд].ВремяОтправки = ТекущаяДата();
		Объект.Сообщения[Инд].Статус = Перечисления.СтатусыСообщений.Отправлено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СообщенияПриАктивизацииСтроки(Элемент)
	СообщенияПриАктивизацииСтрокиНаСервере();
КонецПроцедуры
